In [6]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [7]:
type(np.nan)

float

In [8]:
type(None)

NoneType

# Missing Data

In [10]:
Name=["Tom","Ayan","?"]
Graduated=[True,True,False]
Height=[1.8,1.62,1.02]
age=[25,36,8]

s=pd.Series(['1/18/1995' ,'5/12/1984','7/23/2012'])
date=pd.to_datetime(s)

New=list(zip(date,Name,Graduated,Height,age))
df=pd.DataFrame(New,columns=['data','Name','Graduated','Height','age'])
df

        data  Name  Graduated  Height  age
0 1995-01-18   Tom       True    1.80   25
1 1984-05-12  Ayan       True    1.62   36
2 2012-07-23     ?      False    1.02    8

In [11]:
df.dtypes

data         datetime64[ns]
Name                 object
Graduated              bool
Height              float64
age                   int64
dtype: object

In [12]:
df.loc[2]=np.nan

In [13]:
df

        data  Name  Graduated  Height   age
0 1995-01-18   Tom        1.0    1.80  25.0
1 1984-05-12  Ayan        1.0    1.62  36.0
2        NaT   NaN        NaN     NaN   NaN

In [15]:
df.dtypes

data         datetime64[ns]
Name                 object
Graduated           float64
Height              float64
age                 float64
dtype: object

# NA

In [17]:
pd.Series([1,2,np.nan,4],dtype=pd.Int64Dtype())

0       1
1       2
2    <NA>
3       4
dtype: Int64

# Detecting Missing Values

In [18]:
df

        data  Name  Graduated  Height   age
0 1995-01-18   Tom        1.0    1.80  25.0
1 1984-05-12  Ayan        1.0    1.62  36.0
2        NaT   NaN        NaN     NaN   NaN

In [20]:
df.isnull()

    data   Name  Graduated  Height    age
0  False  False      False   False  False
1  False  False      False   False  False
2   True   True       True    True   True

In [21]:
df.isna()

    data   Name  Graduated  Height    age
0  False  False      False   False  False
1  False  False      False   False  False
2   True   True       True    True   True

In [22]:
df.notna()

    data   Name  Graduated  Height    age
0   True   True       True    True   True
1   True   True       True    True   True
2  False  False      False   False  False

# Replace Unrelated Values

In [27]:
missing_values=["?","_"]
data=pd.read_csv('team.csv',missing_values=missing_values)
data

           name  gender start_date    salary   bonus senior_management team
0        Thomas    Male  3/31/1996   61933.0    4.17              TRUE    ?
1        Louise  Female  8/12/1980   63241.0       _              TRUE  NaN
2             ?    Male  6/14/2012  125792.0   5.042               NaN  NaN
3             ?    Male  8/21/1998  122340.0   6.417               NaN  NaN
4         James     NaN  1/26/2005  128771.0   8.309             FALSE  NaN
5           NaN     NaN        NaN       NaN     NaN                 _  NaN
6   Christopher    Male  4/22/2000   37919.0     NaN             FALSE  NaN
7           NaN  Female  10/3/1990  132373.0  11.449               NaN  NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              TRUE  NaN
9       Michael    Male  1/24/2002   43586.0  12.659             FALSE  NaN
10       Jeremy    Male  6/14/1988  129460.0  13.657              TRUE  NaN

In [28]:
data.replace({"?":np.nan,'_':np.nan},inplace=True)

# Handling Missing Values

# a.Removing Data

In [30]:
data.dropna(axis=0,how='all')

           name  gender start_date    salary   bonus senior_management  team
0        Thomas    Male  3/31/1996   61933.0    4.17              TRUE   NaN
1        Louise  Female  8/12/1980   63241.0     NaN              TRUE   NaN
2           NaN    Male  6/14/2012  125792.0   5.042               NaN   NaN
3           NaN    Male  8/21/1998  122340.0   6.417               NaN   NaN
4         James     NaN  1/26/2005  128771.0   8.309             FALSE   NaN
6   Christopher    Male  4/22/2000   37919.0     NaN             FALSE   NaN
7           NaN  Female  10/3/1990  132373.0  11.449               NaN   NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              TRUE   NaN
9       Michael    Male  1/24/2002   43586.0  12.659             FALSE   NaN
10       Jeremy    Male  6/14/1988  129460.0  13.657              TRUE   NaN

In [31]:
data.dropna(axis=1,how='all',inplace=True)

In [33]:
data.dropna(axis=0,how='any')

       name gender start_date    salary   bonus senior_management
0    Thomas   Male  3/31/1996   61933.0    4.17              TRUE
9   Michael   Male  1/24/2002   43586.0  12.659             FALSE
10   Jeremy   Male  6/14/1988  129460.0  13.657              TRUE

In [34]:
data.dropna(axis=0,thresh=2)

           name  gender start_date    salary   bonus senior_management
0        Thomas    Male  3/31/1996   61933.0    4.17              TRUE
1        Louise  Female  8/12/1980   63241.0     NaN              TRUE
2           NaN    Male  6/14/2012  125792.0   5.042               NaN
3           NaN    Male  8/21/1998  122340.0   6.417               NaN
4         James     NaN  1/26/2005  128771.0   8.309             FALSE
6   Christopher    Male  4/22/2000   37919.0     NaN             FALSE
7           NaN  Female  10/3/1990  132373.0  11.449               NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              TRUE
9       Michael    Male  1/24/2002   43586.0  12.659             FALSE
10       Jeremy    Male  6/14/1988  129460.0  13.657              TRUE

In [38]:
data.isnull().sum()*100/data.shape[0]

name                 36.363636
gender               18.181818
start_date            9.090909
salary                9.090909
bonus                36.363636
senior_management    36.363636
dtype: float64

# Data imputation

# b.1 logical rule

In [41]:
data1={'name':['x','y','z'],id:[810195120,810199450,809199198],'year':[95,98,np.nan]}
data1=pd.DataFrame(data1)
data1

  name  <built-in function id>  year
0    x               810195120  95.0
1    y               810199450  98.0
2    z               809199198   NaN

# b.2 imputation using constant values

In [1]:
data.fillna(0)

NameError: name 'data' is not defined

# b.3 imputation using mean/median values

In [43]:
data.salary

0      61933.0
1      63241.0
2     125792.0
3     122340.0
4     128771.0
5          NaN
6      37919.0
7     132373.0
8     130581.0
9      43586.0
10    129460.0
Name: salary, dtype: float64

In [45]:
data.salary.fillna(data.salary.median())

0      61933.0
1      63241.0
2     125792.0
3     122340.0
4     128771.0
5     124066.0
6      37919.0
7     132373.0
8     130581.0
9      43586.0
10    129460.0
Name: salary, dtype: float64

# b.4 interpolation

In [46]:
data.salary.interpolate(method='linear',axis=0)

0      61933.0
1      63241.0
2     125792.0
3     122340.0
4     128771.0
5      83345.0
6      37919.0
7     132373.0
8     130581.0
9      43586.0
10    129460.0
Name: salary, dtype: float64

In [47]:
data.salary

0      61933.0
1      63241.0
2     125792.0
3     122340.0
4     128771.0
5          NaN
6      37919.0
7     132373.0
8     130581.0
9      43586.0
10    129460.0
Name: salary, dtype: float64